In [1]:
import pandas as pd
import numpy as np

In [2]:
s1 = pd.Series(np.arange(4), 
              index=['a', 'c', 'd', 'e'])
s2 = pd.Series(np.arange(5), 
              index=['a', 'c', 'e', 'f', 'g'])

In [3]:
s1

a    0
c    1
d    2
e    3
dtype: int64

In [4]:
s2

a    0
c    1
e    2
f    3
g    4
dtype: int64

In [5]:
s1 + s2

a    0.0
c    2.0
d    NaN
e    5.0
f    NaN
g    NaN
dtype: float64

In [6]:
df1 = pd.DataFrame(np.arange(6).reshape(2, 3),
                  columns=list("ABC"), 
                  index=['Tim', 'Tom'])

df2 = pd.DataFrame(np.arange(9).reshape(3, 3), 
                  columns=list("ACD"), 
                  index=['Tim', 'Kate', 'Tom'])

In [7]:
df1

     A  B  C
Tim  0  1  2
Tom  3  4  5

In [8]:
df2

      A  C  D
Tim   0  1  2
Kate  3  4  5
Tom   6  7  8

In [12]:
df1 + df2

        A   B     C   D
Kate  NaN NaN   NaN NaN
Tim   0.0 NaN   3.0 NaN
Tom   9.0 NaN  12.0 NaN

In [13]:
df1.add(df2, fill_value=0)

        A    B     C    D
Kate  3.0  NaN   4.0  5.0
Tim   0.0  1.0   3.0  2.0
Tom   9.0  4.0  12.0  8.0

In [14]:
1/df1

            A     B    C
Tim       inf  1.00  0.5
Tom  0.333333  0.25  0.2

In [15]:
df1 * 3

     A   B   C
Tim  0   3   6
Tom  9  12  15

In [16]:
df1.mul(3)

     A   B   C
Tim  0   3   6
Tom  9  12  15

In [17]:
df2

      A  C  D
Tim   0  1  2
Kate  3  4  5
Tom   6  7  8

In [20]:
df2.iloc[1]
s = df2.iloc[1]
s

A    3
C    4
D    5
Name: Kate, dtype: int64

In [21]:
df2 - s

      A  C  D
Tim  -3 -3 -3
Kate  0  0  0
Tom   3  3  3

In [22]:
s2 = df2['A']
s2

Tim     0
Kate    3
Tom     6
Name: A, dtype: int64

In [23]:
df2
df2.sub(s2, axis="index")

      A  C  D
Tim   0  1  2
Kate  0  1  2
Tom   0  1  2

In [24]:
df = pd.DataFrame(
    np.random.randn(4, 3),
    columns=list("ABC"), 
    index=['Kim', "Susan", "Tim", "Tom"]
)
df

              A         B         C
Kim   -1.190119 -0.484224  0.259895
Susan  0.442247  0.424549 -1.151509
Tim   -0.014730 -1.289154 -0.316318
Tom    0.259811  1.682560  0.249111

In [25]:
np.abs(df)

              A         B         C
Kim    1.190119  0.484224  0.259895
Susan  0.442247  0.424549  1.151509
Tim    0.014730  1.289154  0.316318
Tom    0.259811  1.682560  0.249111

In [26]:
f = lambda x : x.max() - x.min()

In [27]:
df.apply(f)

A    1.632366
B    2.971714
C    1.411404
dtype: float64

In [28]:
df.apply(f, axis=1)

Kim      1.450014
Susan    1.593756
Tim      1.274423
Tom      1.433449
dtype: float64

In [29]:
df

              A         B         C
Kim   -1.190119 -0.484224  0.259895
Susan  0.442247  0.424549 -1.151509
Tim   -0.014730 -1.289154 -0.316318
Tom    0.259811  1.682560  0.249111